src/Documents/Доставка/Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доставка</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоставок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ФотоДоставок/ФотоДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФотоДоставок</name>
  <comment>mroc-diplom</comment>
  <resources>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.Доставка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Доставка/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//Начало Володин А.А. 08 ноября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	ФотоДоставкиСсылка = "";
	
	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("Доставка", Объект.Ссылка);
	
	ЗаписьВРегистр = РегистрыСведений.ФотоДоставок.СоздатьКлючЗаписи(ЗначениеКлюча);
	
	ФотоДоставкиСсылка = ПолучитьНавигационнуюСсылку(ЗаписьВРегистр, "Фотография", 0);
//Конец Володин А.А. 08 ноября 2024 г.
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//Начало Володин А.А. 08 ноября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	МенеджерЗаписи = РегистрыСведений.ФотоДоставок.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Доставка = Объект.Ссылка;
	
	Если ЭтоАдресВременногоХранилища(ФотоДоставкиСсылка) Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФотоДоставкиСсылка);
		
		МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(ДвоичныеДанные); 
		МенеджерЗаписи.Записать();
		
	ИначеЕсли ФотоДоставкиСсылка = "" Тогда
		
		МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(Неопределено);
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
//Конец Володин А.А. 08 ноября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФотоДоставкиНажатие(Элемент, СтандартнаяОбработка)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	СтандартнаяОбработка = Ложь;
	
	#Если МобильныйКлиент Тогда
		
		Если Не СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			
			Сообщить("Камера не доступна");
			Возврат;
			
		КонецЕсли;
		
		ДанныеФото = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя, , , , ТипПодсветкиКамеры.Авто);
		
		Если ДанныеФото = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ФотоДоставкиСсылка = ПоместитьВоВременноеХранилище(ДанныеФото.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		
	#КонецЕсли
//Конец Володин А.А. 28 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Позвонить(Команда)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	СтандартнаяОбработка = Ложь;
	
	#Если МобильныйКлиент Тогда
		
		Если Не СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
			
			Сообщить("Набор номера не доступен");
			Возврат;
			
		КонецЕсли;
		
		НомерТелефона = ПолучитьНомерТелефона(Объект.Контрагент);
		
		СредстваТелефонии.НабратьНомер(НомерТелефона, Истина);
			
	#КонецЕсли
//Конец Володин А.А. 28 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьНомерТелефона(Контрагент)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НомерТелефона = Выборка.НомерТелефона;
		
	КонецЦикла;
	
	Возврат НомерТелефона;
//Конец Володин А.А. 28 октября 2024 г.
КонецФункции

#КонецОбласти
